pbuchabqui/OpenEMS/firmware_restructured/integration/esp32s3_integration.c
/**
 * @file esp32s3_integration.c
 * @brief Implementação do módulo de integração ESP32-S3
 */

#include "esp32s3_integration.h"
#include "esp_log.h"
#include "hal/hal_timer.h"
#include "espnow_link.h"
#include <string.h>
#include <math.h>

static const char* TAG = "ESP32S3_INTEGRATION";

//=============================================================================
// Funções Estáticas Internas
//=============================================================================

static esp_err_t esp32s3_init_dsp_components(esp32s3_integration_t *integration);
static esp_err_t esp32s3_init_ulp_monitoring(esp32s3_integration_t *integration);
static esp_err_t esp32s3_init_compression(esp32s3_integration_t *integration);
static esp_err_t esp32s3_init_vector_math(esp32s3_integration_t *integration);
static void esp32s3_update_performance_metrics(esp32s3_integration_t *integration);

//=============================================================================
// Funções de Inicialização
//=============================================================================

esp_err_t esp32s3_integration_init(esp32s3_integration_t *integration,
                                   const esp32s3_integration_config_t *config) {
    if (integration == NULL || config == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    
    ESP_LOGI(TAG, "Initializing ESP32-S3 competitive improvements integration v%d", 
              ESP32S3_INTEGRATION_VERSION);
    
    // Limpar estrutura
    memset(integration, 0, sizeof(esp32s3_integration_t));
    
    // Copiar configuração
    integration->config = *config;
    
    // Validar configuração
    if (config->num_cylinders == 0 || config->num_cylinders > ESP32S3_MAX_CYLINDERS) {
        ESP_LOGE(TAG, "Invalid number of cylinders: %d", config->num_cylinders);
        return ESP_ERR_INVALID_ARG;
    }
    
    esp_err_t ret = ESP_OK;
    
    // Inicializar componentes DSP
    if (config->enable_dsp_processing) {
        ret = esp32s3_init_dsp_components(integration);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to initialize DSP components: %s", esp_err_to_name(ret));
            return ret;
        }
    }
    
    // Inicializar monitoramento ULP
    if (config->enable_ulp_monitoring) {
        ret = esp32s3_init_ulp_monitoring(integration);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to initialize ULP monitoring: %s", esp_err_to_name(ret));
            return ret;
        }
    }
    
    // Inicializar compressão
    if (config->enable_compression) {
        ret = esp32s3_init_compression(integration);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to initialize compression: %s", esp_err_to_name(ret));
            return ret;
        }
    }
    
    // Inicializar matemática vetorial
    if (config->enable_vector_timing) {
        ret = esp32s3_init_vector_math(integration);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to initialize vector math: %s", esp_err_to_name(ret));
            return ret;
        }
    }
    
    integration->initialized = true;
    integration->start_time = HAL_Time_us();
    
    ESP_LOGI(TAG, "ESP32-S3 integration initialized successfully");
    ESP_LOGI(TAG, "  DSP processing: %s", config->enable_dsp_processing ? "enabled" : "disabled");
    ESP_LOGI(TAG, "  MAP/TPS optimization: %s", config->enable_map_tps_optimization ? "enabled" : "disabled");
    ESP_LOGI(TAG, "  ULP monitoring: %s", config->enable_ulp_monitoring ? "enabled" : "disabled");
    ESP_LOGI(TAG, "  Compression: %s", config->enable_compression ? "enabled" : "disabled");
    ESP_LOGI(TAG, "  Vector timing: %s", config->enable_vector_timing ? "enabled" : "disabled");
    ESP_LOGI(TAG, "  Cylinders: %d", config->num_cylinders);
    
    return ESP_OK;
}

static esp_err_t esp32s3_init_dsp_components(esp32s3_integration_t *integration) {
    esp_err_t ret;
    
    // Inicializar processador DSP
    ret = dsp_sensor_processor_init(&integration->dsp_processor, 
                                    OPTIMIZED_SENSOR_COUNT, 
                                    integration->config.dsp_sample_rate);
    if (ret != ESP_OK) return ret;
    
    // Inicializar processador MAP/TPS
    map_filter_config_t map_config = {
        .cutoff_freq_idle = 5.0f,
        .cutoff_freq_cruise = 20.0f,
        .cutoff_freq_transient = 50.0f,
        .noise_threshold = 2.0f,
        .pulse_detection_threshold = 10.0f,
        .enable_pulse_detection = true,
        .enable_adaptive_filter = integration->config.enable_adaptive_filters,
        .enable_spectral_analysis = true
    };
    
    tps_filter_config_t tps_config = {
        .cutoff_freq_slow = 5.0f,
        .cutoff_freq_fast = 50.0f,
        .transient_threshold = 5.0f,
        .hysteresis_percent = 2.0f,
        .deadband_percent = 1.0f,
        .enable_transient_detection = true,
        .enable_rate_limiter = true,
        .enable_predictive_filter = true
    };
    
    ret = map_tps_processor_init(&integration->map_tps_processor, &map_config, &tps_config);
    if (ret != ESP_OK) return ret;
    
    ESP_LOGI(TAG, "DSP components initialized");
    return ESP_OK;
}

static esp_err_t esp32s3_init_ulp_monitoring(esp32s3_integration_t *integration) {
    esp_err_t ret;
    
    ret = ulp_monitor_init(&integration->ulp_monitor);
    if (ret != ESP_OK) return ret;
    
    // Configurar limiares críticos
    ret = ulp_monitor_set_critical_thresholds(&integration->ulp_monitor,
                                               integration->config.map_critical_temp,
                                               120.0f, // Oil temp
                                               integration->config.oil_pressure_critical,
                                               10.0f);  // Battery voltage
    if (ret != ESP_OK) return ret;
    
    // Configurar intervalo de amostragem
    ret = ulp_monitor_set_sample_interval(&integration->ulp_monitor,
                                          integration->config.ulp_sample_interval);
    if (ret != ESP_OK) return ret;
    
