pbuchabqui/OpenEMS/firmware_restructured/integration/esp32s3_integration.c
    ESP_LOGI(TAG, "ULP monitoring initialized");
    return ESP_OK;
}

static esp_err_t esp32s3_init_compression(esp32s3_integration_t *integration) {
    espnow_compress_config_t comp_config = {
        .type = integration->config.compression_type,
        .level = integration->config.compression_level,
        .quantization_bits = 10,
        .enable_adaptive = true,
        .use_simd = true,
        .min_size = 64,
        .compression_ratio_target = 0.4f
    };
    
    esp_err_t ret = espnow_compress_init(&integration->compression_context, &comp_config);
    if (ret != ESP_OK) return ret;
    
    ESP_LOGI(TAG, "Compression initialized");
    return ESP_OK;
}

static esp_err_t esp32s3_init_vector_math(esp32s3_integration_t *integration) {
    esp_err_t ret = vector_math_init(&integration->vector_context);
    if (ret != ESP_OK) return ret;
    
    ESP_LOGI(TAG, "Vector math initialized");
    return ESP_OK;
}

esp_err_t esp32s3_integration_start(esp32s3_integration_t *integration) {
    if (integration == NULL || !integration->initialized) {
        return ESP_ERR_INVALID_STATE;
    }
    
    esp_err_t ret = ESP_OK;
    
    // Iniciar monitoramento ULP
    if (integration->config.enable_ulp_monitoring) {
        ret = ulp_monitor_start(&integration->ulp_monitor, integration->config.enable_deep_sleep);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to start ULP monitoring: %s", esp_err_to_name(ret));
            return ret;
        }
    }
    
    integration->running = true;
    integration->last_update_time = (uint32_t)HAL_Time_us();
    
    ESP_LOGI(TAG, "ESP32-S3 integration started");
    return ESP_OK;
}

esp_err_t esp32s3_integration_deinit(esp32s3_integration_t *integration) {
    if (integration == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    
    // Parar processamento
    esp32s3_integration_stop(integration);
    
    // Desinicializar componentes
    if (integration->config.enable_dsp_processing) {
        dsp_sensor_processor_deinit(&integration->dsp_processor);
    }
    
    if (integration->config.enable_ulp_monitoring) {
        ulp_monitor_deinit(&integration->ulp_monitor);
    }
    
    if (integration->config.enable_compression) {
        espnow_compress_deinit(&integration->compression_context);
    }
    
    if (integration->config.enable_vector_timing) {
        vector_math_deinit(&integration->vector_context);
    }
    
    integration->initialized = false;
    
    ESP_LOGI(TAG, "ESP32-S3 integration deinitialized");
    return ESP_OK;
}

//=============================================================================
// Funções de Processamento Principal
//=============================================================================

esp_err_t esp32s3_process_engine_cycle(esp32s3_integration_t *integration,
                                        const float *raw_sensor_data,
                                        esp32s3_process_result_t *result) {
    if (integration == NULL || !integration->initialized || 
        raw_sensor_data == NULL || result == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    
    uint64_t start_time = HAL_Time_us();
    
    // Resetar resultado
    memset(result, 0, sizeof(esp32s3_process_result_t));
    
    esp_err_t ret = ESP_OK;
    
    // Processar sensores
    if (integration->config.enable_dsp_processing && integration->config.enable_map_tps_optimization) {
        ret = esp32s3_process_sensors(integration,
                                      raw_sensor_data[0], // MAP
                                      raw_sensor_data[1], // TPS
                                      raw_sensor_data[2], // CLT
                                      raw_sensor_data[3], // Oil temp
                                      raw_sensor_data[4], // Oil pressure
                                      raw_sensor_data[5]); // Battery
        if (ret != ESP_OK) return ret;
        
        result->sensors_processed = 6;
    }
    
    // Verificar status ULP
    if (integration->config.enable_ulp_monitoring) {
        ret = esp32s3_check_ulp_status(integration,
                                         &result->critical_condition,
                                         NULL, &integration->data.critical_value);
        if (ret != ESP_OK) return ret;
    }
    
    // Calcular timing
    if (integration->config.enable_vector_timing) {
        // Simular cálculos de timing
        for (uint8_t i = 0; i < integration->config.num_cylinders; i++) {
            integration->data.injection_pw[i] = 2000.0f + (i * 100.0f); // Simulação
            integration->data.ignition_advance[i] = 20.0f + (i * 2.0f); // Simulação
        }
        
        ret = esp32s3_calculate_timing(integration,
                                        integration->data.current_rpm,
                                        integration->data.engine_load,
                                        integration->data.injection_pw,
                                        integration->data.ignition_advance);
        if (ret != ESP_OK) return ret;
        
        result->calculations_performed = integration->config.num_cylinders * 2; // injection + ignition
    }
    
    // Atualizar métricas
    integration->data.processing_time_us = (uint32_t)(HAL_Time_us() - start_time);
    result->processing_time_us = integration->data.processing_time_us;
    
    esp32s3_update_performance_metrics(integration);
    result->cpu_usage = integration->data.cpu_usage_percent;
    result->success = true;
    
    integration->update_count++;
    integration->last_update_time = (uint32_t)HAL_Time_us();
    
    ESP_LOGV(TAG, "Engine cycle processed: %d sensors, %d calculations, %d us", 
              result->sensors_processed, result->calculations_performed, result->processing_time_us);
    
    return ESP_OK;
}

esp_err_t esp32s3_process_sensors(esp32s3_integration_t *integration,
                                   float raw_map,
                                   float raw_tps,
                                   float raw_clt,
                                   float raw_oil_temp,
                                   float raw_oil_press,
                                   float raw_vbat) {
    if (integration == NULL || !integration->initialized) {
        return ESP_ERR_INVALID_STATE;
    }
    
    esp_err_t ret;
    
    // Processar MAP e TPS com filtros otimizados
    if (integration->config.enable_map_tps_optimization) {
        ret = map_tps_process_parallel(&integration->map_tps_processor,
                                       raw_map, raw_tps,
                                       &integration->data.map_filtered,
                                       &integration->data.tps_filtered);
        if (ret != ESP_OK) return ret;
        
        // Estimar carga do motor
        ret = map_tps_estimate_engine_load(&integration->map_tps_processor,
                                            integration->data.current_rpm,
                                            &integration->data.engine_load);
        if (ret != ESP_OK) return ret;
        
        // Calcular correlação
        ret = map_tps_calculate_correlation(&integration->map_tps_processor,
                                             &integration->data.map_tps_correlation);
        if (ret != ESP_OK) return ret;
        
