pbuchabqui/OpenEMS/firmware_restructured/integration/esp32s3_integration.c
        // Detectar padrões
        bool accel_pattern, decel_pattern;
        ret = map_tps_detect_patterns(&integration->map_tps_processor,
                                       &accel_pattern, &decel_pattern);
        if (ret == ESP_OK) {
            integration->data.acceleration_detected = accel_pattern;
            integration->data.deceleration_detected = decel_pattern;
        }
    } else {
        // Valores diretos se otimização desabilitada
        integration->data.map_filtered = raw_map;
        integration->data.tps_filtered = raw_tps;
        integration->data.engine_load = raw_map / 250.0f; // Simplificação
    }
    
    // Processar outros sensores com DSP
    if (integration->config.enable_dsp_processing) {
        // CLT
        ret = optimized_process_sensor_sample(&integration->dsp_processor,
                                             OPTIMIZED_SENSOR_CLT,
                                             raw_clt,
                                             &integration->data.clt_filtered);
        if (ret != ESP_OK) return ret;
        
        // Oil temp
        ret = optimized_process_sensor_sample(&integration->dsp_processor,
                                             OPTIMIZED_SENSOR_OIL_TEMP,
                                             raw_oil_temp,
                                             &integration->data.oil_temp_filtered);
        if (ret != ESP_OK) return ret;
        
        // Oil pressure
        ret = optimized_process_sensor_sample(&integration->dsp_processor,
                                             OPTIMIZED_SENSOR_OIL_PRESS,
                                             raw_oil_press,
                                             &integration->data.oil_pressure_filtered);
        if (ret != ESP_OK) return ret;
        
        // Battery voltage
        ret = optimized_process_sensor_sample(&integration->dsp_processor,
                                             OPTIMIZED_SENSOR_VBAT,
                                             raw_vbat,
                                             &integration->data.battery_voltage_filtered);
        if (ret != ESP_OK) return ret;
    } else {
        // Valores diretos se DSP desabilitado
        integration->data.clt_filtered = raw_clt;
        integration->data.oil_temp_filtered = raw_oil_temp;
        integration->data.oil_pressure_filtered = raw_oil_press;
        integration->data.battery_voltage_filtered = raw_vbat;
    }
    
    ESP_LOGV(TAG, "Sensors processed: MAP=%.1f, TPS=%.1f, Load=%.2f", 
              integration->data.map_filtered, integration->data.tps_filtered, 
              integration->data.engine_load);
    
    return ESP_OK;
}

esp_err_t esp32s3_calculate_timing(esp32s3_integration_t *integration,
                                    uint16_t rpm,
                                    float engine_load,
                                    const float *pulse_widths,
                                    const float *advance_angles) {
    if (integration == NULL || !integration->initialized || 
        pulse_widths == NULL || advance_angles == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    
    integration->data.current_rpm = rpm;
    
    if (integration->config.enable_vector_timing) {
        // Usar processamento vetorial para cálculos de timing
        esp_err_t ret = vector_calculate_injection_times_vectorized(&integration->vector_context,
                                                                    rpm,
                                                                    pulse_widths,
                                                                    integration->data.injection_times);
        if (ret != ESP_OK) return ret;
        
        ret = vector_calculate_ignition_times_vectorized(&integration->vector_context,
                                                          rpm,
                                                          advance_angles,
                                                          integration->data.ignition_times);
        if (ret != ESP_OK) return ret;
        
        // Copiar valores para referência
        for (uint8_t i = 0; i < integration->config.num_cylinders; i++) {
            integration->data.injection_pw[i] = pulse_widths[i];
            integration->data.ignition_advance[i] = advance_angles[i];
        }
    } else {
        // Cálculo simplificado sem vetorialização
        float us_per_degree = 166666.67f / (float)rpm;
        
        for (uint8_t i = 0; i < integration->config.num_cylinders; i++) {
            integration->data.injection_pw[i] = pulse_widths[i];
            integration->data.ignition_advance[i] = advance_angles[i];
            
            // Timing simplificado
            float timing_offset = (float)i * (720.0f / integration->config.num_cylinders);
            integration->data.injection_times[i] = (uint32_t)((timing_offset - advance_angles[i]) * us_per_degree);
            integration->data.ignition_times[i] = (uint32_t)((timing_offset + advance_angles[i]) * us_per_degree);
        }
    }
    
    ESP_LOGV(TAG, "Timing calculated for %d cylinders at %d RPM", 
              integration->config.num_cylinders, rpm);
    
    return ESP_OK;
}

esp_err_t esp32s3_check_ulp_status(esp32s3_integration_t *integration,
                                      bool *critical_condition,
                                      ulp_adc_channel_t *critical_channel,
                                      float *critical_value) {
    if (integration == NULL || !integration->initialized || critical_condition == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    
    if (!integration->config.enable_ulp_monitoring) {
        *critical_condition = false;
        return ESP_OK;
    }
    
    ulp_check_result_t ulp_result;
    esp_err_t ret = ulp_monitor_check_status(&integration->ulp_monitor, &ulp_result);
    if (ret != ESP_OK) return ret;
    
    *critical_condition = ulp_result.critical_condition;
    integration->data.ulp_critical_condition = ulp_result.critical_condition;
    
