pbuchabqui/OpenEMS/firmware_restructured/integration/esp32s3_integration.c
    if (ulp_result.critical_condition) {
        integration->data.critical_channel = ulp_result.critical_channel;
        integration->data.critical_value = ulp_result.critical_value;
        
        if (critical_channel) *critical_channel = ulp_result.critical_channel;
        if (critical_value) *critical_value = ulp_result.critical_value;
        
        ESP_LOGW(TAG, "ULP critical condition: channel=%d, value=%.2f", 
                  ulp_result.critical_channel, ulp_result.critical_value);
    }
    
    return ESP_OK;
}

//=============================================================================
// Funções de Comunicação e Telemetria
//=============================================================================

esp_err_t esp32s3_prepare_telemetry(esp32s3_integration_t *integration,
                                      uint8_t *output_buffer,
                                      uint16_t buffer_size,
                                      uint16_t *compressed_size) {
    if (integration == NULL || !integration->initialized || 
        output_buffer == NULL || compressed_size == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    
    // Preparar mensagem de status do motor
    espnow_engine_status_t status = {
        .rpm = integration->data.current_rpm,
        .map_kpa10 = (uint16_t)(integration->data.map_filtered * 10),
        .clt_c10 = (int16_t)(integration->data.clt_filtered * 10),
        .iat_c10 = (int16_t)(integration->data.oil_temp_filtered * 10), // Usando oil temp como IAT
        .tps_pct10 = (uint16_t)(integration->data.tps_filtered * 10),
        .battery_mv = (uint16_t)(integration->data.battery_voltage_filtered * 1000),
        .sync_status = 1, // Simplificado
        .limp_mode = integration->data.ulp_critical_condition ? 1 : 0,
        .advance_deg10 = (uint16_t)(integration->data.ignition_advance[0] * 10),
        .pw_us = (uint16_t)integration->data.injection_pw[0],
        .lambda_target = 1450, // Stoichiometric
        .lambda_measured = 1450, // Simplificado
        .timestamp_ms = (uint32_t)(HAL_Time_us() / 1000)
    };
    
    if (integration->config.enable_compression) {
        // Comprimir mensagem
        espnow_compress_result_t comp_result;
        esp_err_t ret = espnow_compress_engine_status(&integration->compression_context,
                                                      &status,
                                                      output_buffer,
                                                      buffer_size,
                                                      &comp_result);
        if (ret != ESP_OK) return ret;
        
        *compressed_size = comp_result.compressed_size;
        integration->data.compression_ratio = comp_result.compression_ratio;
        
        ESP_LOGV(TAG, "Telemetry compressed: %d->%d bytes, ratio=%.2f", 
                  sizeof(status), *compressed_size, comp_result.compression_ratio);
    } else {
        // Sem compressão
        if (buffer_size < sizeof(status)) {
            return ESP_ERR_INVALID_SIZE;
        }
        memcpy(output_buffer, &status, sizeof(status));
        *compressed_size = sizeof(status);
        integration->data.compression_ratio = 1.0f;
    }
    
    return ESP_OK;
}

//=============================================================================
// Funções Utilitárias
//=============================================================================

static void esp32s3_update_performance_metrics(esp32s3_integration_t *integration) {
    if (integration == NULL || !integration->initialized) {
        return;
    }
    
    // Calcular uso de CPU baseado no tempo de processamento
    uint32_t cycle_time_us = 1000000 / ESP32S3_MAIN_PROCESSING_FREQ;
    integration->data.cpu_usage_percent = 
        (float)integration->data.processing_time_us / (float)cycle_time_us * 100.0f;
    
    // Limitar a 100%
    if (integration->data.cpu_usage_percent > 100.0f) {
        integration->data.cpu_usage_percent = 100.0f;
    }
}

esp_err_t esp32s3_get_performance_stats(esp32s3_integration_t *integration,
                                         float *cpu_usage,
                                         uint32_t *processing_time,
                                         float *compression_ratio,
                                         uint32_t *ulp_wakeups) {
    if (integration == NULL || !integration->initialized) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (cpu_usage) *cpu_usage = integration->data.cpu_usage_percent;
    if (processing_time) *processing_time = integration->data.processing_time_us;
    if (compression_ratio) *compression_ratio = integration->data.compression_ratio;
    
    if (ulp_wakeups && integration->config.enable_ulp_monitoring) {
        uint32_t total_wakeups, critical_wakeups;
        ulp_monitor_get_statistics(&integration->ulp_monitor, &total_wakeups, 
                                   &critical_wakeups, NULL, NULL);
        *ulp_wakeups = total_wakeups;
    }
    
    return ESP_OK;
}

esp_err_t esp32s3_check_system_health(esp32s3_integration_t *integration,
                                        bool *all_operational) {
    if (integration == NULL || !integration->initialized || all_operational == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    
    bool operational = true;
    
    // Verificar componentes DSP
    if (integration->config.enable_dsp_processing) {
        // Verificar se processador DSP está operacional
        if (integration->dsp_processor.initialized == false) {
            operational = false;
            ESP_LOGW(TAG, "DSP processor not operational");
        }
    }
    
    // Verificar monitoramento ULP
    if (integration->config.enable_ulp_monitoring) {
        bool ulp_operational;
        esp_err_t ret = ulp_monitor_is_operational(&integration->ulp_monitor, &ulp_operational);
        if (ret != ESP_OK || !ulp_operational) {
            operational = false;
            ESP_LOGW(TAG, "ULP monitor not operational");
        }
    }
    
    // Verificar compressão
    if (integration->config.enable_compression) {
        if (integration->compression_context.initialized == false) {
            operational = false;
            ESP_LOGW(TAG, "Compression not operational");
        }
    }
    
    // Verificar matemática vetorial
    if (integration->config.enable_vector_timing) {
        if (integration->vector_context.initialized == false) {
            operational = false;
            ESP_LOGW(TAG, "Vector math not operational");
        }
    }
    
    *all_operational = operational;
    
    ESP_LOGI(TAG, "System health check: %s", operational ? "OK" : "FAILURES DETECTED");
    
    return ESP_OK;
}
